#include <iostream>
#include <string.h>

// Найдите сумму натуральных чисел, которые делятся на 5 и не делятся на m (m<n).
// Количество натуральных чисел n и значение m введите с клавиатуры.

int main() {
    
    int start=0;
    int stop=5;

    while (start > stop) {
        std::cout << start << std::endl;
    }
    
    return 0;

}